// Show Azure AD invalid username or password attempts if the # of IP's is > 1
SigninLogs
| where ResultType == "50126" // Invalid username or password
| project Identity, Location, IPAddress
| summarize IPs = dcount(IPAddress), Locations = make_set(Location) by Identity
| where IPs > 1
| sort by IPs desc
