// Show Azure AD password spray, > 2  different user logon from same IP-address
SigninLogs
| where ResultType == "50053" // Invalid username or password
| project Identity, Location, IPAddress
| summarize USERs = make_set(Identity) by IPAddress
| where USERs[1] != ""  
