// Password spray attack: > 2 identities from same IP-address
SigninLogs
| where ResultType == "50053" or ResultType == "50126" 
| project Identity, Location, IPAddress
| summarize USERs = make_set(Identity) by Location, IPAddress
| where USERs[1] != ""
