// Targeted brute force attack: > 2 location to the same Identity
SigninLogs
| where ResultType == "50126" or ResultType == "50053"
| project Identity, Location, IPAddress
| summarize IPs = dcount(IPAddress), Locations = make_set(Location) by Identity
| where IPs > 1
| sort by IPs desc 
